# Series :

`It is a single list with the index`

`It is a 1-D array.`

In [1]:
import pandas as pd
import numpy as np

In [2]:
# Read csv file

titanic = pd.read_csv('Course_Materials_Part1\\Course_Materials_Part1\\Video_Lecture_NBs\\titanic.csv')
titanic

     survived  pclass     sex   age  sibsp  parch     fare embarked deck
0           0       3    male  22.0      1      0   7.2500        S  NaN
1           1       1  female  38.0      1      0  71.2833        C    C
2           1       3  female  26.0      0      0   7.9250        S  NaN
3           1       1  female  35.0      1      0  53.1000        S    C
4           0       3    male  35.0      0      0   8.0500        S  NaN
..        ...     ...     ...   ...    ...    ...      ...      ...  ...
886         0       2    male  27.0      0      0  13.0000        S  NaN
887         1       1  female  19.0      0      0  30.0000        S    B
888         0       3  female   NaN      1      2  23.4500        S  NaN
889         1       1    male  26.0      0      0  30.0000        C    C
890         0       3    male  32.0      0      0   7.7500        Q  NaN

[891 rows x 9 columns]

In [3]:
# data head

titanic.head()

   survived  pclass     sex   age  sibsp  parch     fare embarked deck
0         0       3    male  22.0      1      0   7.2500        S  NaN
1         1       1  female  38.0      1      0  71.2833        C    C
2         1       3  female  26.0      0      0   7.9250        S  NaN
3         1       1  female  35.0      1      0  53.1000        S    C
4         0       3    male  35.0      0      0   8.0500        S  NaN

In [4]:
# select single column of the data

titanic['age']

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
886    27.0
887    19.0
888     NaN
889    26.0
890    32.0
Name: age, Length: 891, dtype: float64

In [5]:
# type of the data

type(titanic.age)

pandas.core.series.Series

### Analysis of numerical (continuous number) column

In [6]:
# Create a series from dataframe
# type and d-type of age

age = titanic['age']
age, type(age), age.dtype

(0      22.0
 1      38.0
 2      26.0
 3      35.0
 4      35.0
        ...
 886    27.0
 887    19.0
 888     NaN
 889    26.0
 890    32.0
 Name: age, Length: 891, dtype: float64,
 pandas.core.series.Series,
 dtype('float64'))

In [7]:
# View first 5 rows data

age.head()

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
Name: age, dtype: float64

In [8]:
# Shape of data

age.shape

(891,)

In [9]:
# Info of the data

age.info()

<class 'pandas.core.series.Series'>
RangeIndex: 891 entries, 0 to 890
Series name: age
Non-Null Count  Dtype
--------------  -----
714 non-null    float64
dtypes: float64(1)
memory usage: 7.1 KB

#### to_frame()

In [10]:
# Convert Series into dataframe

age.to_frame()

      age
0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
..    ...
886  27.0
887  19.0
888   NaN
889  26.0
890  32.0

[891 rows x 1 columns]

In [11]:
[[1,2,3,4,5,5,5]].to_frame()

AttributeError: 'list' object has no attribute 'to_frame'

In [12]:
# Convert Series into dataframe

pd.Series([1,2,3,4,4], name='temp').to_frame()

   temp
0     1
1     2
2     3
3     4
4     4

In [13]:
np.array([1,2,3,4,5]).to_frame()

AttributeError: 'numpy.ndarray' object has no attribute 'to_frame'

In [14]:
# Info of the data

age.to_frame().info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 1 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   age     714 non-null    float64
dtypes: float64(1)
memory usage: 7.1 KB

In [15]:
# Tells number of not null values in the data

age.count()

714

In [16]:
# Total number of rows*columns

age.size

891

In [17]:
# skipna= False means to consider null values
# Adding anything to nan/null is nan/null

age.sum(skipna= False)

nan

In [18]:
# skipna= True means to not consider null values

age.sum(skipna= True)

21205.17

#### unique and nunique

In [19]:
# View unique values

age.unique()

array([22.  , 38.  , 26.  , 35.  ,   nan, 54.  ,  2.  , 27.  , 14.  ,
        4.  , 58.  , 20.  , 39.  , 55.  , 31.  , 34.  , 15.  , 28.  ,
        8.  , 19.  , 40.  , 66.  , 42.  , 21.  , 18.  ,  3.  ,  7.  ,
       49.  , 29.  , 65.  , 28.5 ,  5.  , 11.  , 45.  , 17.  , 32.  ,
       16.  , 25.  ,  0.83, 30.  , 33.  , 23.  , 24.  , 46.  , 59.  ,
       71.  , 37.  , 47.  , 14.5 , 70.5 , 32.5 , 12.  ,  9.  , 36.5 ,
       51.  , 55.5 , 40.5 , 44.  ,  1.  , 61.  , 56.  , 50.  , 36.  ,
       45.5 , 20.5 , 62.  , 41.  , 52.  , 63.  , 23.5 ,  0.92, 43.  ,
       60.  , 10.  , 64.  , 13.  , 48.  ,  0.75, 53.  , 57.  , 80.  ,
       70.  , 24.5 ,  6.  ,  0.67, 30.5 ,  0.42, 34.5 , 74.  ])

In [20]:
# View unique values
# By default dropna = True(it do not include null value)

age.nunique()

88

In [21]:
# View unique values
# By default dropna = False(it include null value)

age.nunique(dropna=False)

89

In [22]:
# Data - mean, median, standard deviation, min and max

age.mean(), age.median(), age.std(), age.min(), age.max()

(29.69911764705882, 28.0, 14.526497332334044, 0.42, 80.0)

In [23]:
# Data description(Descriptive Statistics)

age.describe()

count    714.000000
mean      29.699118
std       14.526497
min        0.420000
25%       20.125000
50%       28.000000
75%       38.000000
max       80.000000
Name: age, dtype: float64

#### value_counts()

In [24]:
# Count the values
# By defauly sort= True, dropna= True, ascending= False

age.value_counts()

age
24.00    30
22.00    27
18.00    26
19.00    25
28.00    25
         ..
36.50     1
55.50     1
0.92      1
23.50     1
74.00     1
Name: count, Length: 88, dtype: int64

In [25]:
# Count the values
# parameter sort= True sorts the value in descending order

age.value_counts(sort= True)

age
24.00    30
22.00    27
18.00    26
19.00    25
28.00    25
         ..
36.50     1
55.50     1
0.92      1
23.50     1
74.00     1
Name: count, Length: 88, dtype: int64

In [26]:
# Count the values
# parameter sort= True sorts the value in ascending order

age.value_counts(sort= False)

age
22.00    27
38.00    11
26.00    18
35.00    18
54.00     8
         ..
0.67      1
30.50     2
0.42      1
34.50     1
74.00     1
Name: count, Length: 88, dtype: int64

In [27]:
# Count the values
# parameter sort= True sorts the value in ascending order, dropna= False (Include the null values)

age.value_counts(sort= True, dropna= False)

age
NaN      177
24.00     30
22.00     27
18.00     26
28.00     25
        ...
36.50      1
55.50      1
0.92       1
23.50      1
74.00      1
Name: count, Length: 89, dtype: int64

In [28]:
# Count the values
# parameter sort= True sorts the value in ascending order, dropna= True (do not include the null values)

age.value_counts(ascending= True)

age
74.0     1
14.5     1
70.5     1
12.0     1
36.5     1
        ..
30.0    25
19.0    25
18.0    26
22.0    27
24.0    30
Name: count, Length: 88, dtype: int64

In [29]:
# Count the values
# parameter ascending= False (give value in descending order)

age.value_counts(ascending= False)

age
24.00    30
22.00    27
18.00    26
19.00    25
28.00    25
         ..
36.50     1
55.50     1
0.92      1
23.50     1
74.00     1
Name: count, Length: 88, dtype: int64

In [30]:
# Count the values
# parameter ascending= False (give value in descending order),
# parameter sort= True sorts the value in ascending order, dropna= False (Include the null values)

age.value_counts(sort= True, dropna= False, ascending= True)

age
74.0      1
34.5      1
14.5      1
70.5      1
12.0      1
       ...
28.0     25
18.0     26
22.0     27
24.0     30
NaN     177
Name: count, Length: 89, dtype: int64

In [31]:
# Count the values
# parameter ascending= True (give value in ascending order),
# parameter sort= True sorts the value in ascending order, dropna= False (Include the null values)
# parameter normalize= False, by default it is false

age.value_counts(sort= True, dropna= False, ascending= True, normalize= False)

age
74.0      1
34.5      1
14.5      1
70.5      1
12.0      1
       ...
28.0     25
18.0     26
22.0     27
24.0     30
NaN     177
Name: count, Length: 89, dtype: int64

In [32]:
# parameter normalize= True Normalize data in the range of 0-1
# Count the values

age.value_counts(sort= True, dropna= False, ascending= True, normalize= True)

age
74.0    0.001122
34.5    0.001122
14.5    0.001122
70.5    0.001122
12.0    0.001122
          ...
28.0    0.028058
18.0    0.029181
22.0    0.030303
24.0    0.033670
NaN     0.198653
Name: proportion, Length: 89, dtype: float64

In [33]:
# create bins= 5
# Count the values

age.value_counts(sort= True, dropna= False, ascending= True, normalize= True, bins= 5)

(64.084, 80.0]      0.012346
(48.168, 64.084]    0.077441
(0.339, 16.336]     0.112233
(32.252, 48.168]    0.210999
(16.336, 32.252]    0.388328
Name: proportion, dtype: float64

In [38]:
# create bins= 5
# Count the values

age.value_counts(sort= True, dropna= False, ascending= True, bins= 5)

(64.084, 80.0]       11
(48.168, 64.084]     69
(0.339, 16.336]     100
(32.252, 48.168]    188
(16.336, 32.252]    346
Name: count, dtype: int64

In [35]:
# create bins= 5
# Count the values

age.value_counts(sort= True, dropna= True, ascending= True, bins= 5)

(64.084, 80.0]       11
(48.168, 64.084]     69
(0.339, 16.336]     100
(32.252, 48.168]    188
(16.336, 32.252]    346
Name: count, dtype: int64

In [39]:
# create bins= 10
# Count the values

age.value_counts(bins= 10)

(16.336, 24.294]    177
(24.294, 32.252]    169
(32.252, 40.21]     118
(40.21, 48.168]      70
(0.339, 8.378]       54
(8.378, 16.336]      46
(48.168, 56.126]     45
(56.126, 64.084]     24
(64.084, 72.042]      9
(72.042, 80.0]        2
Name: count, dtype: int64

### Analysis of categorical column

In [40]:
# Read csv file

summer = pd.read_csv('..\\summer.csv')
summer

,Year,City,Sport,Discipline,Athlete,Country,Gender,Event,Medal
0,1896,Athens,Aquatics,Swimming,"HAJOS, Alfred",HUN,Men,100M Freestyle,Gold
1,1896,Athens,Aquatics,Swimming,"HERSCHMANN, Otto",AUT,Men,100M Freestyle,Silver
2,1896,Athens,Aquatics,Swimming,"DRIVAS, Dimitrios",GRE,Men,100M Freestyle For Sailors,Bronze
3,1896,Athens,Aquatics,Swimming,"MALOKINIS, Ioannis",GRE,Men,100M Freestyle For Sailors,Gold
4,1896,Athens,Aquatics,Swimming,"CHASAPIS, Spiridon",GRE,Men,100M Freestyle For Sailors,Silver
...,...,...,...,...,...,...,...,...,...
31160,2012,London,Wrestling,Wrestling Freestyle,"JANIKOWSKI, Damian",POL,Men,Wg 84 KG,Bronze
31161,2012,London,Wrestling,Wrestling Freestyle,"REZAEI, Ghasem Gholamreza",IRI,Men,Wg 96 KG,Gold
31162,2012,London,Wrestling,Wrestling Freestyle,"TOTROV, Rustam",RUS,Men,Wg 96 KG,Silver
31163,2012,London,Wrestling,Wrestling Freestyle,"ALEKSANYAN, Artur",ARM,Men,Wg 96 KG,Bronze
31164,2012,London,Wrestling,Wrestling Freestyle,"LIDBERG, Jimmy",SWE,Men,Wg 96 KG,Bronze

In [41]:
# Data info

summer.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 31165 entries, 0 to 31164
Data columns (total 9 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Year        31165 non-null  int64
 1   City        31165 non-null  object
 2   Sport       31165 non-null  object
 3   Discipline  31165 non-null  object
 4   Athlete     31165 non-null  object
 5   Country     31161 non-null  object
 6   Gender      31165 non-null  object
 7   Event       31165 non-null  object
 8   Medal       31165 non-null  object
dtypes: int64(1), object(8)
memory usage: 2.1+ MB

In [42]:
# Create a series from dataframe

athlete = summer['Athlete']
athlete

0                    HAJOS, Alfred
1                 HERSCHMANN, Otto
2                DRIVAS, Dimitrios
3               MALOKINIS, Ioannis
4               CHASAPIS, Spiridon
                   ...
31160           JANIKOWSKI, Damian
31161    REZAEI, Ghasem Gholamreza
31162               TOTROV, Rustam
31163            ALEKSANYAN, Artur
31164               LIDBERG, Jimmy
Name: Athlete, Length: 31165, dtype: object

In [44]:
# dtype, shape, size, count, unique, nunique, min and max of a series data

print('\n\n',athlete.dtype,'\n\n',athlete.shape,'\n\n',athlete.size,'\n\n',athlete.count(),'\n\n',athlete.unique(),'\n\n',
athlete.nunique(dropna= False),'\n\n',athlete.nunique(),'\n\n',len(athlete.unique()),'\n\n',athlete.min(),'\n\n',athlete.max())

 object

 (31165,)

 31165

 31165

 ['HAJOS, Alfred' 'HERSCHMANN, Otto' 'DRIVAS, Dimitrios' ...
 'TOTROV, Rustam' 'ALEKSANYAN, Artur' 'LIDBERG, Jimmy']

 22762

 22762

 22762

 AABYE, Edgar

 Ã–STRAND, Per-Olof

In [45]:
# Count the values by narmalize the data

athlete.value_counts(normalize= True, sort= False, ascending= True, dropna= False)

Athlete
HAJOS, Alfred                0.000064
HERSCHMANN, Otto             0.000064
DRIVAS, Dimitrios            0.000032
MALOKINIS, Ioannis           0.000032
CHASAPIS, Spiridon           0.000032
                               ...
JANIKOWSKI, Damian           0.000032
REZAEI, Ghasem Gholamreza    0.000032
TOTROV, Rustam               0.000032
ALEKSANYAN, Artur            0.000032
LIDBERG, Jimmy               0.000032
Name: proportion, Length: 22762, dtype: float64

### Sorting

In [47]:
summer

,Year,City,Sport,Discipline,Athlete,Country,Gender,Event,Medal
0,1896,Athens,Aquatics,Swimming,"HAJOS, Alfred",HUN,Men,100M Freestyle,Gold
1,1896,Athens,Aquatics,Swimming,"HERSCHMANN, Otto",AUT,Men,100M Freestyle,Silver
2,1896,Athens,Aquatics,Swimming,"DRIVAS, Dimitrios",GRE,Men,100M Freestyle For Sailors,Bronze
3,1896,Athens,Aquatics,Swimming,"MALOKINIS, Ioannis",GRE,Men,100M Freestyle For Sailors,Gold
4,1896,Athens,Aquatics,Swimming,"CHASAPIS, Spiridon",GRE,Men,100M Freestyle For Sailors,Silver
...,...,...,...,...,...,...,...,...,...
31160,2012,London,Wrestling,Wrestling Freestyle,"JANIKOWSKI, Damian",POL,Men,Wg 84 KG,Bronze
31161,2012,London,Wrestling,Wrestling Freestyle,"REZAEI, Ghasem Gholamreza",IRI,Men,Wg 96 KG,Gold
31162,2012,London,Wrestling,Wrestling Freestyle,"TOTROV, Rustam",RUS,Men,Wg 96 KG,Silver
31163,2012,London,Wrestling,Wrestling Freestyle,"ALEKSANYAN, Artur",ARM,Men,Wg 96 KG,Bronze
31164,2012,London,Wrestling,Wrestling Freestyle,"LIDBERG, Jimmy",SWE,Men,Wg 96 KG,Bronze

In [48]:
# Create a series from dataframe

year = summer['Year']
year

0        1896
1        1896
2        1896
3        1896
4        1896
         ...
31160    2012
31161    2012
31162    2012
31163    2012
31164    2012
Name: Year, Length: 31165, dtype: int64

#### sort_index()

In [49]:
# sort index

age.sort_index()

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
886    27.0
887    19.0
888     NaN
889    26.0
890    32.0
Name: age, Length: 891, dtype: float64

In [50]:
# sort index with parameter ascending and inplace

year.sort_index(ascending= False, inplace= True)
year

31164    2012
31163    2012
31162    2012
31161    2012
31160    2012
         ...
4        1896
3        1896
2        1896
1        1896
0        1896
Name: Year, Length: 31165, dtype: int64

In [51]:
# sort index with parameter inplace (permanent change)

year.sort_index(inplace= True)
year

0        1896
1        1896
2        1896
3        1896
4        1896
         ...
31160    2012
31161    2012
31162    2012
31163    2012
31164    2012
Name: Year, Length: 31165, dtype: int64

In [52]:
# sort index with parameter na_position (to take NaN values in the last)

year.sort_index(na_position= 'last')
year

0        1896
1        1896
2        1896
3        1896
4        1896
         ...
31160    2012
31161    2012
31162    2012
31163    2012
31164    2012
Name: Year, Length: 31165, dtype: int64

#### sort_values()

In [53]:
# Sort the values of the series with NaN values on the top

age.sort_values(ascending= False, na_position= 'last', ignore_index = True)

0      80.0
1      74.0
2      71.0
3      71.0
4      70.5
       ...
886     NaN
887     NaN
888     NaN
889     NaN
890     NaN
Name: age, Length: 891, dtype: float64

In [54]:
year.sort_values()

0        1896
97       1896
98       1896
99       1896
100      1896
         ...
29858    2012
29857    2012
29856    2012
29884    2012
31164    2012
Name: Year, Length: 31165, dtype: int64

### nlargest() and nsmallest()

In [56]:
# To view n-largest numbers
# By default it gives 5 values

age.nlargest(n=3)

630    80.0
851    74.0
96     71.0
Name: age, dtype: float64

In [57]:
# To view n-largest numbers
# By default it gives 5 values

age.nlargest(n=3, keep= 'all')

630    80.0
851    74.0
96     71.0
493    71.0
Name: age, dtype: float64

In [58]:
# To view n-smallest numbers
# By default it gives 5 values

age.nsmallest(n=3)

803    0.42
755    0.67
469    0.75
Name: age, dtype: float64

In [59]:
# To view index of n-largest numbers
# By default it gives 5 values

age.nlargest(n=3).index

Index([630, 851, 96], dtype='int64')

In [60]:
# To view n-smallest numbers
# By default it gives 5 values
# Error due to wrong indexing

age.nsmallest(n=3)[1]

KeyError: 1

In [62]:
age.nsmallest(n=3).reset_index()

   index   age
0    803  0.42
1    755  0.67
2    469  0.75

In [63]:
# To view n-smallest numbers
# By default it gives 5 values
# Slicing of the n-smallest numbers by resetting the index and droping the old index
# error due to not droping the old index, which is now one of the column

age.nsmallest(n=3).reset_index()[1]

KeyError: 1

In [64]:
# To view n-smallest numbers
# By default it gives 5 values
# Slicing of the n-smallest numbers by resetting the index

print(age.nsmallest(n=3).reset_index())
print(age.nsmallest(n=3).reset_index()['age'][1])

   index   age
0    803  0.42
1    755  0.67
2    469  0.75
0.67

In [65]:
# To view n-smallest numbers
# By default it gives 5 values
# Slicing of the n-smallest numbers by resetting the index and droping the old index

age.nsmallest(n=3).reset_index(drop=True)[1]

0.67

#### reset_index()

In [66]:
age

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
886    27.0
887    19.0
888     NaN
889    26.0
890    32.0
Name: age, Length: 891, dtype: float64

In [67]:
# reset index of a dataframe

ss = age.reset_index()
ss

     index   age
0        0  22.0
1        1  38.0
2        2  26.0
3        3  35.0
4        4  35.0
..     ...   ...
886    886  27.0
887    887  19.0
888    888   NaN
889    889  26.0
890    890  32.0

[891 rows x 2 columns]

#### rename()

In [68]:
# rename column name from index to nums
# axis= 1 means for columns and axis=0 means rows, inplace= True is for making permanent change
# axis= 1 or axis= 'columns'
# axis= 0 or axis= 'index'

# ss.rename({'index' : 'nums'},inplace= True, axis= 1) # It is also correct 
ss.rename({'index' : 'nums'},inplace= True, axis= 'columns')
ss

     nums   age
0       0  22.0
1       1  38.0
2       2  26.0
3       3  35.0
4       4  35.0
..    ...   ...
886   886  27.0
887   887  19.0
888   888   NaN
889   889  26.0
890   890  32.0

[891 rows x 2 columns]

### idxmin() and idxmax() :
`It returns the index number of min/max values for that column`

In [69]:
# To know the index number of the max value in that column

titanic['age'].idxmax()

630

In [70]:
# To know the value of the index no. 630 of the column name 'age'

titanic['age'].iloc[630]

80.0

In [71]:
# To know the max value in the column

titanic['age'].max()

80.0

In [72]:
# To know the index number of the min value in that column

titanic['age'].idxmin()

803

In [73]:
# To know the value of the index no. 803 of the column name 'age'

titanic['age'].iloc[803]

0.42

In [74]:
# To know the min value in the column

titanic['age'].min()

0.42